app/controllers/movies_controller.rb

SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "me"]]
---
  def select_by_director
    @movie = Movie.find(params[:id])
    if @movie.director.empty?