app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "director", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hi"], ["rating", "G"], ["director", "me"], ["release_date", "2023-10-26 00:00:00.000000"], ["created_at", "2023-10-26 20:25:09.079663"], ["updated_at", "2023-10-26 20:25:09.079663"]]

  def select_by_director
    #select movie by director
    # @movie = Movie.find(params[:id])
    # @director = @movie.director
    # other_movies = Movie.search_directors(@movie.director).where.not(title: @movie.title)
    # if other_movies.search_directors(@director).length == 0
    #   flash[:warning] = "'#{@movie.title}' has no director info"
    #   redirect_to movies_path
    # end
    @movie = Movie.find(params[:id])
    if @movie.director.blank?
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.search_directors(@movie.director)
    end
    @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ?  ORDER BY "movies"."id" ASC LIMIT 1  [["director", "me"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ? AND ("movies"."title" != ?) AND "movies"."director" = ?  [["director", "me"], ["title", "Amelie"], ["director", "me"]]